{"pageProps":{"code":"var Component=(()=>{var d=Object.create;var r=Object.defineProperty;var m=Object.getOwnPropertyDescriptor;var u=Object.getOwnPropertyNames;var p=Object.getPrototypeOf,f=Object.prototype.hasOwnProperty;var g=(t,e)=>()=>(e||t((e={exports:{}}).exports,e),e.exports),y=(t,e)=>{for(var n in e)r(t,n,{get:e[n],enumerable:!0})},s=(t,e,n,o)=>{if(e&&typeof e==\"object\"||typeof e==\"function\")for(let a of u(e))!f.call(t,a)&&a!==n&&r(t,a,{get:()=>e[a],enumerable:!(o=m(e,a))||o.enumerable});return t};var v=(t,e,n)=>(n=t!=null?d(p(t)):{},s(e||!t||!t.__esModule?r(n,\"default\",{value:t,enumerable:!0}):n,t)),b=t=>s(r({},\"__esModule\",{value:!0}),t);var h=g((C,c)=>{c.exports=_jsx_runtime});var k={};y(k,{default:()=>j,frontmatter:()=>w});var i=v(h()),w={title:\"Lament of Academia\",abstract:\"A critical reflection on the current state and challenges of modern academic institutions\",date:\"2023-09-19\",type:\"Education\",banner:\"/static/lament-of-academia-banner.jpg\"};function l(t){let e=Object.assign({h2:\"h2\",p:\"p\",ol:\"ol\",li:\"li\"},t.components);return(0,i.jsxs)(i.Fragment,{children:[(0,i.jsx)(e.h2,{id:\"introduction\",children:\"Introduction\"}),(0,i.jsx)(e.p,{children:\"In the pursuit of objectivity, modern academia has achieved something unintended: the systematic removal of humanity from scholarly work. While the scientific method demands rigor and reproducibility, the current academic landscape has taken this principle to an extreme, creating sterile documents that mask the very essence of discovery and intellectual growth.\"}),(0,i.jsx)(e.h2,{id:\"the-current-state-of-academia\",children:\"The Current State of Academia\"}),(0,i.jsx)(e.p,{children:\"Today's academic papers read more like technical manuals than chronicles of discovery. In our zealous pursuit of objectivity, we've stripped away the author's beliefs, personality, and emotional journey\\u2014the very elements that originally guided their thought process and led to their conclusions. This sanitization of academic writing has transformed vibrant intellectual explorations into lifeless artifacts, preserved in the amber of peer-reviewed journals.\"}),(0,i.jsx)(e.h2,{id:\"challenges-and-concerns\",children:\"Challenges and Concerns\"}),(0,i.jsx)(e.p,{children:\"Consider the state of research in the analytical sciences. Giants like Richard Feynman approached problem-solving with a meditative, almost exploratory mindset\\u2014their process resembling more a contemplative walk through a garden than a march down a predetermined path. Yet when these explorations yield results and are published, the final product becomes devoid of the personal journey, insights, and reflections that shaped it. All that remains is the outcome, stripped of its human context.\"}),(0,i.jsx)(e.p,{children:\"This sterilization of academic writing has far-reaching consequences. It leads people to perceive science as a collection of dogmatic, unquestionable axioms\\u2014a dangerous misconception that threatens the very foundation of scientific inquiry. Science is not a set of immutable truths, but rather a living, breathing process of discovery and refinement.\"}),(0,i.jsx)(e.h2,{id:\"potential-solutions\",children:\"Potential Solutions\"}),(0,i.jsx)(e.p,{children:\"To address these challenges, we must reconsider how we approach academic writing:\"}),(0,i.jsxs)(e.ol,{children:[(0,i.jsx)(e.li,{children:\"Embrace narrative elements that showcase the journey of discovery\"}),(0,i.jsx)(e.li,{children:\"Include personal insights and reflections that led to key breakthroughs\"}),(0,i.jsx)(e.li,{children:\"Maintain scientific rigor while preserving the human element\"}),(0,i.jsx)(e.li,{children:\"Encourage transparency about the thought processes behind research\"})]}),(0,i.jsx)(e.h2,{id:\"moving-forward\",children:\"Moving Forward\"}),(0,i.jsx)(e.p,{children:\"If we continue to strip humanity from academic writing, we risk intellectual stagnation. The path forward requires a delicate balance: maintaining the objectivity necessary for scientific validity while preserving the human elements that make research relatable, engaging, and truly illuminating. Only by reconnecting with the personal aspects of academic pursuit can we hope to inspire the next generation of scholars and thinkers.\"})]})}function x(t={}){let{wrapper:e}=t.components||{};return e?(0,i.jsx)(e,Object.assign({},t,{children:(0,i.jsx)(l,t)})):l(t)}var j=x;return b(k);})();\n;return Component;","frontmatter":{"title":"Lament of Academia","abstract":"A critical reflection on the current state and challenges of modern academic institutions","date":"2023-09-19","type":"Education","banner":"/static/lament-of-academia-banner.jpg"},"timecode":"00:01:49:20","ogImage":"undefined/og/714edade8c9a48ca606532ee6a915f62.png"},"__N_SSG":true}