{"pageProps":{"code":"var Component=(()=>{var c=Object.create;var s=Object.defineProperty;var u=Object.getOwnPropertyDescriptor;var m=Object.getOwnPropertyNames;var f=Object.getPrototypeOf,p=Object.prototype.hasOwnProperty;var g=(n,e)=>()=>(e||n((e={exports:{}}).exports,e),e.exports),y=(n,e)=>{for(var i in e)s(n,i,{get:e[i],enumerable:!0})},r=(n,e,i,a)=>{if(e&&typeof e==\"object\"||typeof e==\"function\")for(let o of m(e))!p.call(n,o)&&o!==i&&s(n,o,{get:()=>e[o],enumerable:!(a=u(e,o))||a.enumerable});return n};var w=(n,e,i)=>(i=n!=null?c(f(n)):{},r(e||!n||!n.__esModule?s(i,\"default\",{value:n,enumerable:!0}):i,n)),b=n=>r(s({},\"__esModule\",{value:!0}),n);var l=g((O,h)=>{h.exports=_jsx_runtime});var I={};y(I,{default:()=>v,frontmatter:()=>k});var t=w(l()),k={title:\"Thinking In Words\",abstract:\"An exploration of my thoughts and reflections on written expression\",date:\"2023-08-08\",type:\"Personal\",banner:\"/static/thinking-in-words-banner.jpg\"};function d(n){let e=Object.assign({h2:\"h2\",p:\"p\"},n.components);return(0,t.jsxs)(t.Fragment,{children:[(0,t.jsx)(e.h2,{id:\"introduction\",children:\"Introduction\"}),(0,t.jsx)(e.p,{children:\"Stop for a moment and think to yourself about anything. You most likely used words. I find it very interesting that we think in words. One cannot really 'stop' thinking like this unless he just stops having that perpetual conversation with himself.\"}),(0,t.jsx)(e.h2,{id:\"key-thoughts\",children:\"Key Thoughts\"}),(0,t.jsx)(e.p,{children:\"One may then question whether the speed at which he thinks is limited by the efficiency of his words. I believe this is true, and I imagine that there exists some variance in average rate of analysis between the languages.\"}),(0,t.jsx)(e.p,{children:\"When we think in words, particularly in sentences, it generally tends to be rather analytical. One idea leads to another to form a cogent and complex whole idea. It is hard to imagine doing this without words as this is really the only way we know how to express these ideas. Without it, the output of our intellect should be expected to be scattered and incoherent.\"}),(0,t.jsx)(e.h2,{id:\"different-forms-of-thinking\",children:\"Different Forms of Thinking\"}),(0,t.jsx)(e.p,{children:\"We do not always think in words, however. If you were to imagine a skyscraper on an empty lot across from you, you would not use words to imagine it, describing each floor in grueling detail. Instead, your thoughts will be more oriented on color, shape, and dimensionality.\"}),(0,t.jsx)(e.p,{children:'\"A picture is worth a thousand words.\" This is obviously a far more efficient way to think about things and understand the idea.'}),(0,t.jsx)(e.p,{children:\"One also possesses the ability to think purely in numbers. Indeed, for some tasks, this tends to be the most efficient option as well.\"}),(0,t.jsx)(e.h2,{id:\"reflections\",children:\"Reflections\"}),(0,t.jsx)(e.p,{children:\"The brain is excellent at using various learned notations to approach different problems. Our thinking is dynamic and, in my opinion, rather efficient.\"}),(0,t.jsx)(e.p,{children:\"Theoretically, can it be improved? Yes, if the notation is improved.\"}),(0,t.jsx)(e.p,{children:\"This is the difference between humans and computers. Computers have an exceptionally efficient language of 1's and 0's, while human language is generally far more complex.\"}),(0,t.jsx)(e.h2,{id:\"conclusion\",children:\"Conclusion\"}),(0,t.jsx)(e.p,{children:\"If one improves the medium of communication, the optimization of the human intellect should follow.\"}),(0,t.jsx)(e.p,{children:\"Is this necessary at the moment? In my opinion, no. As mentioned before, I believe our thought processes to be quite efficient and beautiful as it is.\"})]})}function x(n={}){let{wrapper:e}=n.components||{};return e?(0,t.jsx)(e,Object.assign({},n,{children:(0,t.jsx)(d,n)})):d(n)}var v=x;return b(I);})();\n;return Component;","frontmatter":{"title":"Thinking In Words","abstract":"An exploration of my thoughts and reflections on written expression","date":"2023-08-08","type":"Personal","banner":"/static/thinking-in-words-banner.jpg"},"timecode":"00:01:47:70","ogImage":"undefined/og/b0591d064d387e202eb4488bed47847d.png"},"__N_SSG":true}